test_cases/2d_water/2d_flashingHotWaterNozzle_Mesh1_2d/0.orig/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.110000E+07;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    inlet            
    {
      type    fixedValue;
      value   uniform 0.110000E+07  ;
    }

    outlet
    {
      type    inletOutlet;
      inletValue uniform 0.110000E+07 ;
      value uniform 0.110000E+07 ;
    }
    
    wedge_front          
    {
        type            wedge;
    }

    wedge_back          
    {
        type            wedge;
    }

}

// ************************************************************************* //
