test_cases/2d_water/2d_flashingHotWaterNozzle_Mesh1_2d/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 6000000;

boundaryField
{
    inlet
    {
        type            transonicTotalPressure;
        phi             phiv;
        p0              6000000;
        value           uniform 6000000;
    }
    outlet
    {
        type            timeVaryingTransonicTotalPressure;
        U               U;
        phi             phiv;
        file            "outP.dat";
        rho             rho;
        psi             none;
        gamma           1.4;
        p0              1.01E5;
        value           uniform 6000000;
    }
    walls
    {
        type            zeroGradient;
    }
    
    wedge_front          
    {
        type            wedge;
    }

    wedge_back          
    {
        type            wedge;
    }

}


// ************************************************************************* //
