test_cases/2d_water/2d_flashingHotWaterNozzle_Mesh1_2d/0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 796.673;

boundaryField
{
    inlet
    {
        type            thermDensity;
        inletValue      uniform 796.673;
        value           uniform 796.673;
    }
    outlet
    {
        type            thermDensity;
        inletValue      uniform 1.95;
        value           uniform 70.39;
    }
    walls
    {
        type            zeroGradient;
    }
    
    wedge_front          
    {
        type            wedge;
    }

    wedge_back          
    {
        type            wedge;
    }

}


// ************************************************************************* //
