test_cases/2d_water/2d_flashingHotWaterNozzle_Mesh1_2d/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel  RNGkEpsilon;

turbulence      on;

printCoeffs     on;

// Standard k-epsilon model coefficients
kEpsilonCoeffs
{
    // Cmu
    Cmu              0.09;
    // C1
    C1               1.44;
    // C2
    C2               1.92;
    // alphaEps
    alphaEps         0.76923;
}

// RNG k-epsilon model coefficients
RNGkEpsilonCoeffs
{
    // Cmu
    Cmu              0.0845;
    // C1
    C1               1.42;
    // C2
    C2               1.68;
    // alphak
    alphak           1.39;
    // alphaEps
    alphaEps         1.39;
    // eta0
    eta0             4.38;
    // beta
    beta             0.012;
}

// ************************************************************************* //
